Repository: JoseluCross/cryptoJKA
Catalog: src/i18n-templates/*.po
Languages: es

source: cryptoJKA, version: %s
es: cryptoJKA, versión: %s

source: No option specified
es: Ninguna opción seleccionada

source: Use cryptojka --help
es: Usa cryptojka --help

source: cryptoJKA from JKA Network - Version: %s
es: cryptoJKA de JKA Network - Versión: %s

source: The text must be between ASCII 32 and ASCII 126
es: El texto debe estar entre ASCII 32 y ASCII 126

source: Options:
es: Opciones:

source: -f [file_name] input file
es: -f [nombre del archivo] fichero de entrada

source: -o [file_name] output file (default : crypt.out)
es: -o [nombre del archivo] fichero de salida (por defecto: crypt.out)

source: -p [text] password (default: pass)
es: -p [texto] contraseña (por defecto: pass)

source: -t [text] text (default: text) If you put -f and -t, text have preference
es: -t [texto] texto (por defecto: text) Si pones -f y -t, el texto tiene preferencia

source: -e encrypt mode
es: -e modo cifrar

source: -d decrypt mode
es: -d modo descifrar

source: -r [number] with random generation [number of character]
es: -r [número] con generación aleatorio de texto [número de caracteres]

source: -b cyption mode whith before algorithm (before version 0.4.5)
es: -b algoritmo de cifrado antiguo (antes de la version 0.4.5)

source: -h, --help show this box
es: -h, --help muestra esta ayuda

source: -v, --version show version
es: -v, --versión muestra la versión

source: Examples:
es: Ejemplos:

source: cryptojka -e -t "Example text" -p password -o file_name -r 600
es: cryptojka -e -t "Texto de ejemplo" -p contraseña -o nombre_de_archivo -r 600

source: cryptojka -d -f file_name -p password
es: cryptojka -d -f nombre_de_archivo -p contraseña
